/* errAuthorizationInvalidSet */
"-60001" = "Auktoriseringsbehörigheterna är ogiltiga.";

/* errAuthorizationInvalidRef */
"-60002" = "Auktoriseringsreferensen är ogiltig.";

/* errAuthorizationInvalidTag */
"-60003" = "Auktoriseringstaggen är ogiltig.";

/* errAuthorizationInvalidPointer */
"-60004" = "Den returnerade auktoriseringen är ogiltig.";

/* errAuthorizationDenied */
"-60005" = "Behörighet nekades.";

/* errAuthorizationCanceled */
"-60006" = "Behörighetskontrollen avbröts av användaren.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "Behörighet nekades eftersom ingen användarmedverkan var möjlig.";

/* errAuthorizationInternal */
"-60008" = "Kan inte skaffa auktorisering för denna åtgärd.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Auktoriseringen får inte konverteras till ett externt format.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Auktoriseringen får inte skapas från ett externt format.";

/* errAuthorizationInvalidFlags */
"-60011" = "Angivna alternativflaggor gäller inte för denna auktoriseringsåtgärd.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Det angivna programmet kunde inte köras.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "En ogiltig status returnerades under körning av ett privilegierat verktyg.";

/* errAuthorizationBadAddress */
"-60033" = "Den begärda sockeladressen är ogiltig (måste vara från 0 till 1023).";

/* errSSLProtocol */
"-9800" = "Fel i SSL-protokoll";

/* errSSLNegotiation */
"-9801" = "Cipher Suite-förhandlingsfel";

/* errSSLFatalAlert */
"-9802" = "Allvarlig varning";

/* errSSLWouldBlock */
"-9803" = "I/O would block (not fatal)";

/* errSSLSessionNotFound */
"-9804" = "ett försök att återställa en okänd session";

/* errSSLClosedGraceful */
"-9805" = "anslutningen stängdes på rätt sätt";

/* errSSLClosedAbort */
"-9806" = "anslutningen stängdes p.g.a. ett fel";

/* errSSLXCertChainInvalid */
"-9807" = "ogiltig certifikatskedja";

/* errSSLBadCert */
"-9808" = "felaktigt certifikatsformat";

/* errSSLCrypto */
"-9809" = "underliggande kryptografiskt fel";

/* errSSLInternal */
"-9810" = "Internt fel";

/* errSSLModuleAttach */
"-9811" = "fel vid bifogning av modul";

/* errSSLUnknownRootCert */
"-9812" = "giltig certifikatskedja, root opålitlig";

/* errSSLNoRootCert */
"-9813" = "certifikatskedja ej bekräftad av root";

/* errSSLCertExpired */
"-9814" = "kedjan innehöll ett utgånget certifikat";

/* errSSLCertNotYetValid */
"-9815" = "kedjan hade ett certifikat som ännu inte är giltigt";

/* errSSLClosedNoNotify */
"-9816" = "server stängde sessioner utan föregående varning";

/* errSSLBufferOverflow */
"-9817" = "otillräcklig buffert erbjuden";

/* errSSLBadCipherSuite */
"-9818" = "felaktig SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "oväntat meddelande mottaget";

/* errSSLPeerBadRecordMac */
"-9820" = "felaktig MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "avkryptering misslyckades";

/* errSSLPeerRecordOverflow */
"-9822" = "record overflow";

/* errSSLPeerDecompressFail */
"-9823" = "fel vid dekomprimering";

/* errSSLPeerHandshakeFail */
"-9824" = "fel vid handskakning";

/* errSSLPeerBadCert */
"-9825" = "blandade felaktiga certifikat";

/* errSSLPeerUnsupportedCert */
"-9826" = "felaktigt icke stött certifikatsformat";

/* errSSLPeerCertRevoked */
"-9827" = "certifikat återkallat";

/* errSSLPeerCertExpired */
"-9828" = "certifikat för gammalt";

/* errSSLPeerCertUnknown */
"-9829" = "okänt certifikat";

/* errSSLIllegalParam */
"-9830" = "otillåten parameter";

/* errSSLPeerUnknownCA */
"-9831" = "okänd certifikatsutfärdare";

/* errSSLPeerAccessDenied */
"-9832" = "åtkomst nekad";

/* errSSLPeerDecodeError */
"-9833" = "avkodningsfel";

/* errSSLPeerDecryptError */
"-9834" = "avkrypteringsfel";

/* errSSLPeerExportRestriction */
"-9835" = "exportrestriktion";

/* errSSLPeerProtocolVersion */
"-9836" = "felaktig protokollversion";

/* errSSLPeerInsufficientSecurity */
"-9837" = "otillräcklig säkerhet";

/* errSSLPeerInternalError */
"-9838" = "Internt fel";

/* errSSLPeerUserCancelled */
"-9839" = "avbröts av användaren";

/* errSSLPeerNoRenegotiation */
"-9840" = "ingen omförhandling tillåten";

/* errSSLServerAuthCompleted */
"-9841" = "servercertifikat är giltigt, eller ignorerades vid avaktiverad verifiering";

/* errSSLClientCertRequested */
"-9842" = "server har begärt ett klientcertifikat";

/* errSSLHostNameMismatch */
"-9843" = "peer-värdnamn överensstämmer inte";

/* errSSLConnectionRefused */
"-9844" = "peer släppte anslutningen innan svar gavs";

/* errSSLDecryptionFail */
"-9845" = "avkrypteringsfel";

/* errSSLBadRecordMac */
"-9846" = "felaktig MAC";

/* errSSLRecordOverflow */
"-9847" = "record overflow";

/* errSSLBadConfiguration */
"-9848" = "konfigurationsfel";

/* errSecSuccess */
"0" = "Inget fel.";

/* errSecUnimplemented */
"-4" = "Funktion eller åtgärd är inte implementerad.";

/* errSecParam */
"-50" = "En eller flera av parametrarna som skickades till funktionen är ogiltig.";

/* errSecAllocate */
"-108" = "Kunde inte allokera minne.";

/* errSecNotAvailable */
"-25291" = "Ingen nyckelring är tillgänglig. Du kan behöva starta om datorn.";

/* errSecReadOnly */
"-25292" = "Den här nyckelringen kan inte ändras.";

/* errSecAuthFailed */
"-25293" = "Användarnamnet eller lösenfrasen är inte korrekt.";

/* errSecNoSuchKeychain */
"-25294" = "Den angivna nyckelringen kunde inte hittas.";

/* errSecInvalidKeychain */
"-25295" = "Den angivna nyckelringen är inte en giltig nyckelringsfil.";

/* errSecDuplicateKeychain */
"-25296" = "Det finns redan en nyckelring med samma namn.";

/* errSecDuplicateCallback */
"-25297" = "Den angivna funktionen för återuppringning är redan installerad.";

/* errSecInvalidCallback */
"-25298" = "Den angivna funktionen för återuppringning är ogiltig.";

/* errSecDuplicateItem */
"-25299" = "Det angivna objektet finns redan i nyckelringen.";

/* errSecItemNotFound */
"-25300" = "Det angivna objektet kunde inte hittas i nyckelringen.";

/* errSecBufferTooSmall */
"-25301" = "Det finns inte tillräckligt med ledigt minne för att använda det angivna objektet.";

/* errSecDataTooLarge */
"-25302" = "Detta objekt innehåller information som är för stor eller i ett format som inte kan visas.";

/* errSecNoSuchAttr */
"-25303" = "Det angivna attributet finns inte.";

/* errSecInvalidItemRef */
"-25304" = "Det angivna objektet är inte längre giltigt. Det kan ha raderats från nyckelringen.";

/* errSecInvalidSearchRef */
"-25305" = "Kunde inte söka i den aktuella nyckelringen.";

/* errSecNoSuchClass */
"-25306" = "Det angivna objektet verkar inte vara ett giltigt nyckelringsobjekt.";

/* errSecNoDefaultKeychain */
"-25307" = "Det gick inte att hitta en standardnyckelring.";

/* errSecInteractionNotAllowed */
"-25308" = "Användaren kan inte påverka processen.";

/* errSecReadOnlyAttr */
"-25309" = "Det angivna attributet kunde inte ändras.";

/* errSecWrongSecVersion */
"-25310" = "Denna nyckelring skapades av en annan version av systemprogrammet och kan inte öppnas.";

/* errSecKeySizeNotAllowed */
"-25311" = "Den angivna nyckelstorleken för detta objekt är för stor.";

/* errSecNoStorageModule */
"-25312" = "En nödvändig komponent (datalagringsmodul) kunde inte läsas in. Du kan behöva starta om datorn.";

/* errSecNoCertificateModule */
"-25313" = "En nödvändig komponent (certifikatmodul) kunde inte läsas in. Du kan behöva starta om datorn.";

/* errSecNoPolicyModule */
"-25314" = "En nödvändig komponent (regelmodul) kunde inte läsas in. Du kan behöva starta om datorn.";

/* errSecInteractionRequired */
"-25315" = "Användarens medverkan krävs, men är inte tillåten för närvarande.";

/* errSecDataNotAvailable */
"-25316" = "Innehållet i detta objekt kan inte hämtas.";

/* errSecDataNotModifiable */
"-25317" = "Innehållet i detta objekt kan inte ändras.";

/* errSecCreateChainFailed */
"-25318" = "Ett eller flera certifikat som krävs för att verifiera det här certifikatet kan inte hittas.";

/* errSecInvalidPrefsDomain */
"-25319" = "Den angivna inställningsdomänen är ogiltig.";

/* errSecACLNotSimple */
"-25240" = "Den angivna behörighetslistan är inte i standardformat (enkelt format).";

/* errSecPolicyNotFound */
"-25241" = "Den angivna regeln kan inte hittas.";

/* errSecInvalidTrustSetting */
"-25242" = "Den angivna pålitlighetsinställningen är ogiltig.";

/* errSecNoAccessForItem */
"-25243" = "Det angivna objektet har ingen behörighetskontroll.";

/* errSecInvalidOwnerEdit */
"-25244" = "Ogiltigt försök att byta ägare på detta objekt.";

/* errSecTrustNotAvailable */
"-25245" = "Inga pålitlighetsresultat är tillgängliga.";

/* errSecUnsupportedFormat */
"-25256" = "Import/export-formatet kan inte användas.";

/* errSecUnknownFormat */
"-25257" = "Okänt format för import.";

/* errSecKeyIsSensitive */
"-25258" = "Nyckelmaterial måste packas ihop för export.";

/* errSecMultiplePrivKeys */
"-25259" = "Ett försök gjordes att importera flera privata nycklar.";

/* errSecPassphraseRequired */
"-25260" = "Lösenfras krävs för import/export.";

/* errSecInvalidPasswordRef */
"-25261" = "Lösenordsreferensen var ogiltig.";

/* errSecInvalidTrustSettings */
"-25262" = "Posten för tillförlitlighetsinställningar var skadad.";

/* errSecNoTrustSettings */
"-25263" = "Inga tillförlitlighetsinställningar hittades.";

/* errSecPkcs12VerifyFailure */
"-25264" = "MAC-verifiering misslyckades vid PKCS12-import.";

/* errSecDecode */
"-26275" = "Kan inte avkoda tillhandahållen data.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP Vector of Buffers Error Values.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP Cryptographic Context Error Values.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP Staged Cryptographic API Error Values.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Ett försök gjordes att använda en publik nyckel som är inkomplett på grund av * avsaknaden av algoritmspecifika parametrar.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "en kodsignatursmatchning misslyckades";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Key StartDate/EndDate ogiltigt";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Felkoder för nyckelringsautentisering";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2-paddingkontroll: Rollback Attack upptäckt";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "Argumentet OpenParameters som överfördes till CSSM_DL_DbCreate eller CSSM_DL_DbOpen var varken NULL eller en pekare till en giltig CSSM_APPLEDL_OPEN_PARAMETERS-struktur.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "en åtgärd misslyckades eftersom skivan var full";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "en åtgärd misslyckades eftersom en skivkvot överskreds";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "en åtgärd misslyckades eftersom en fil var för stor";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "en nyckelringsdatabas interna information (”blob”) är ogiltig";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "den interna dataformatsversionen för en databas interna information (”blob”) är ogiltig";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Ej matchande värdnamn";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Tillägg som inte förstås med kritisk flaggning sann";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Tillägg för grundläggande restriktioner krävs per policy, men finns inte";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Ogiltiga BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Ogiltigt organisationsnyckel-ID ";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Ogiltigt ämnesnyckel-ID ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Ogiltig nyckelanvändning för policy";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Ogiltig utökad nyckelanvändning för policy";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Ogiltig koppling ämne/organisationsnyckel-ID";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint överskreds";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Certfikat stoppades vid ett rootcertifikat som inte självverifierades";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL har gått ut/är inte giltig ännu";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Kan inte hitta lämplig CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "Angiven CRL-server är inte tillgänglig";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "Oläsbar CRL-distributionspunkt-URL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Okänt kritiskt certifikat/CRL-tillägg";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL kan ej verifieras hos anchor eller root";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verifierad hos ej tillförlitlig rot";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL klarade ej policyverifiering";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Överträdelse av tillägg för IssuingDistributionPoint";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Cert ej hittat hos specificerad issuerAltName";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Ogiltigt cert erhållet från specificerad issuerAltName";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME, ej matchande e-postadress";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Lämplig ExtendedKeyUsage för S/MIME hittades ej";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME, inkompatibel KeyUsage";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, certifikat med KeyUsage flaggad !kritiskt";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, blad med tomt ämnesnamn och utan e-postadresser * i SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, blad med tomt ämnesnamn, SubjectAltName * inte kritiskt";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Lämplig SSL ExtendedKeyUsage hittades inte";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "icke analyserbart OCSP-svar";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "icke analyserbar OCSP-begäran";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP-tjänst otillgänglig";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP-status: certifikat okänt";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "anulleringskontroll lyckades inte för alla certifikat";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "allmänt nätverksfel";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP-svar kan inte verifieras till anchor eller root";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP-svar verifierat till otillförlitlig root";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP-svarssignaturfel";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Ingen undertecknare för OCSP-svar hittades";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP-responderstatus: felaktigt utformad begäran";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP-responderstatus: internt fel";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP-responderstatus: försök senare";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP-responderstatus: signatur krävs";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP-responderstatus: ickeauktoriserad";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP-svar nonce matchade inte begäran";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "otillåten certifieringskedjelängd för kodsignering";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Saknade grundläggande begränsningar för kodsignering";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Felaktig PathLengthConstraint för kodsignering";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Saknad ExtendedKeyUsage för kodsignering";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Kodsigneringscertifikat av utvecklingstyp upptäckt";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "otillåten certifieringskedjelängd för resurssignering";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "felaktig utökad nyckelanvändning för resurssignering";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Tillförlitlighetsinställning: neka";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "ogiltigt tomt SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "okänt Qualified Cert Statement ID";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "certifikatsbegäran köad";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "certfikatsbegäran omdirigerad";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "allmänt serverrapporterat fel";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "serverrapporterat parameterfel";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "serverrapporterat auktoriseringsfel";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "serverrapporterad är inte implementerad";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "serverrapporterad ej tillgänglig";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "serverrapporterad finns redan";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "serverrapporterat tjänstefel";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "begäran redan väntande för angiven användare";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "ingen väntande begäran för angiven användare";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR kunde inte verifieras";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "server rapporterade misslyckad konsekvenskontroll";

/* errSecCSUnimplemented */
"-67072" = "icke implementerad kodsignatursfunktion";

/* errSecCSInvalidObjectRef */
"-67071" = "ogiltig API-objektreferens";

/* errSecCSInvalidFlags */
"-67070" = "ogiltiga eller ickestödda API-flaggor angavs";

/* errSecCSObjectRequired */
"-67069" = "en krävd pekare var NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "kan inte hitta kodobjekt på skiva";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "kan inte lokalisera gäster med detta attributvärde";

/* errSecCSInvalidAttributeValues */
"-67066" = "givna attributvärden är ogiltiga";

/* errSecCSNoSuchCode */
"-67065" = "värden har inga gäster med begärda attribut";

/* errSecCSMultipleGuests */
"-67064" = "värden har flera gäster med detta attributvärde";

/* errSecCSGuestInvalid */
"-67063" = "kodidentitet har blivit ogiltigförklarad";

/* errSecCSUnsigned */
"-67062" = "kodobjekt är inte signerat";

/* errSecCSSignatureFailed */
"-67061" = "kod eller signatur ändrad";

/* errSecCSSignatureNotVerifiable */
"-67060" = "signaturen kan inte läsas, t.ex. p.g.a. ett filsystem som mappar till en användare som saknar behörigheter";

/* errSecCSSignatureUnsupported */
"-67059" = "ickestödd typ eller version av signatur";

/* errSecCSBadDictionaryFormat */
"-67058" = "en plist-fil eller resurs som krävs är felaktigt utformad";

/* errSecCSResourcesNotSealed */
"-67057" = "resurser är inte förseglade av signatur";

/* errSecCSResourcesNotFound */
"-67056" = "kan inte hitta förseglad resurs i koden";

/* errSecCSResourcesInvalid */
"-67055" = "den förseglade resursens mapp är ogiltig";

/* errSecCSBadResource */
"-67054" = "en förseglad resurs saknas eller är ogiltig";

/* errSecCSResourceRulesInvalid */
"-67053" = "ogiltiga resursvalsregler";

/* errSecCSReqInvalid */
"-67052" = "ogiltiga eller skadade kodkrav";

/* errSecCSReqUnsupported */
"-67051" = "ickestödd typ eller version av kodkrav";

/* errSecCSReqFailed */
"-67050" = "kunde inte uppfylla kodkrav";

/* errSecCSBadObjectFormat */
"-67049" = "objektets filformat ogiltigt eller olämpligt";

/* errSecCSInternalError */
"-67048" = "internt fel i undersystem för kodsignering";

/* errSecCSHostReject */
"-67047" = "koden avvisade dess värd";

/* errSecCSNotAHost */
"-67046" = "denna kod är inte en värd";

/* errSecCSSignatureInvalid */
"-67045" = "ogiltigt signaturformat";

/* errSecCSHostProtocolRelativePath */
"-67044" = "överträdelse av värdprotokoll - absolut gästsökväg krävs";

/* errSecCSHostProtocolContradiction */
"-67043" = "överträdelse av värdprotokoll - motsägelsefulla värdlägen";

/* errSecCSHostProtocolDedicationError */
"-67042" = "överträdelse av värdprotokoll - åtgärden tillåts ej med/för en dedikerad gäst";

/* errSecCSHostProtocolNotProxy */
"-67041" = "överträdelse av värdprotokoll - proxyvärdskap ej aktiverat";

/* errSecCSHostProtocolStateError */
"-67040" = "överträdelse av värdprotokoll - ogiltig begäran om ändring av gäststatus";

/* errSecCSHostProtocolUnrelated */
"-67039" = "överträdelse av värdprotokoll - den angivna gästen är inte en gäst hos angiven värd";

/* errSecCSInvalidOperation */
"-67038" = "den begärda åtgärden är ogiltig";

/* errSecCSNotSupported */
"-67037" = "åtgärden har inte stöd för den här kodtypen";

/* errSecCSCMSTooLarge */
"-67036" = "signaturen för stor för inbyggnad";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "överträdelse av värdprotokoll - ogiltig gäst-hash";

/* errSecCSStaticCodeChanged */
"-67034" = "programmet på skivan matchar inte vad som körs";

/* errSecCSSigDBDenied */
"-67033" = "åtkomst till signaturdatabas nekad";

/* errSecCSSigDBAccess */
"-67032" = "ingen åtkomst till signaturdatabasen";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "värd svarade med ogiltiga eller inkonsekventa gästattribut";

/* errSecMisc_dskFulErr */
"-34" = "Skivan är full.";

/* errSecMisc_nsvErr */
"-35" = "Skivan kunde inte hittas. Den kan ha matats ut.";

/* errSecMisc_bdNamErr */
"-37" = "Försökte öppna en fil vars namn innehåller ett otillåtet tecken.";

/* errSecMisc_fnfErr */
"-43" = "Filen kunde inte hittas.";

/* errSecMisc_wPrErr */
"-44" = "Skivan är skrivskyddad.";

/* errSecMisc_fLckdErr */
"-45" = "Filen är låst.";

/* errSecMisc_vLckdErr */
"-46" = "Enheten är låst.";

/* errSecMisc_fBsyErr */
"-47" = "Filen är upptagen. Den kanske används av ett annat program.";

/* errSecMisc_dupFNErr */
"-48" = "Det finns redan en fil med samma namn.";

/* errSecMisc_opWrErr */
"-49" = "Filen redan är öppen med skrivbehörighet.";

/* errSecMisc_volOffLinErr */
"-53" = "Enheten är inte längre tillgänglig. Den kan ha matats ut.";

/* errSecMisc_permErr */
"-54" = "Filen kunde inte öppnas. Den kanske används av ett annat program.";

/* errSecMisc_extFSErr */
"-58" = "Enheten verkar inte vara kompatibel.";

/* errSecMisc_wrPermErr */
"-61" = "Kunde inte skriva till filen. Den kan ha öppnats med otillräckliga åtkomsträttigheter.";

/* errSecMisc_offLinErr */
"-65" = "Lagringsenheten är inte längre tillgänglig. Den kan ha matats ut.";

/* errSecMisc_dirNFErr */
"-120" = "Katalogen kunde inte hittas.";

/* errSecMisc_volGoneErr */
"-124" = "Serverenheten är inte längre tillgänglig. Den kan ha kopplats ner.";

/* errSecMisc_userCanceledErr */
"-128" = "Åtgärden avbröts av användaren.";

/* errSecMisc_resNotFound */
"-192" = "En nödvändig resurs kunde inte hittas.";

/* errSecMisc_resFNotFound */
"-193" = "En nödvändig resurs saknas eller är skadad.";

/* errSecMisc_icNoURLErr */
"-673" = "Den angivna platsen (URL) är av en okänd typ eller innehåller inte tillräckligt med information.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Kunde inte hitta något hjälpprogram för att öppna den angivna länken (URL).";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "Objektets plats (URL) saknas eller är felaktigt formaterad.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Åtkomst till detta objekt är begränsad.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Autentiseringen misslyckades. Lösenordet för den här servern kan ha ändrats sedan objektet lades till i nyckelringen.";
